### DATAFRAME

### DIFFERENT TYPES OF DATAFRAME

In [4]:
# FROM DICTIONARY
import pandas as pd
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]} 
data

{'country': ['india', 'uk', 'austria', 'us'], 'GDP': [123, 345, 678, 2134]}

In [5]:
df=pd.DataFrame(data)
df

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

In [7]:
import numpy as np
data={"country":["india","uk","austria","us",np.nan],"GDP":[123,345,678,np.nan,2134]} 
data

{'country': ['india', 'uk', 'austria', 'us', nan],
 'GDP': [123, 345, 678, nan, 2134]}

In [8]:
d=d={"name":["piya","riya","asshi","meera"],"age":['20','30','60','23'],\
   "height":[120.3,152.4,155,162],"gender":["f","f","m","f"]}  ## \ is used to break the lines
df=pd.DataFrame(d)
df

    name age  height gender
0   piya  20   120.3      f
1   riya  30   152.4      f
2  asshi  60   155.0      m
3  meera  23   162.0      f

In [ ]:
## task 1: take a string from the user 
d={0:"M",1:"A",2:"D" 3}
## TASK 2: ASCii value corresponding to its key value
## task 3: make a student d

In [9]:
### checking the column types(df.dtypes)
df.dtypes

name       object
age        object
height    float64
gender     object
dtype: object

In [12]:
df["age"]=df["age"].astype(int)

In [11]:
df.dtypes

name       object
age         int32
height    float64
gender     object
dtype: object

In [13]:
df["age"].dtype

dtype('int32')

### info

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int32
 2   height  4 non-null      float64
 3   gender  4 non-null      object
dtypes: float64(1), int32(1), object(2)
memory usage: 240.0+ bytes

#### create the dataframe from list

In [15]:
l1=[1,2,3,4]
df=pd.DataFrame(l1)
df

   0
0  1
1  2
2  3
3  4

In [16]:
type(df)

pandas.core.frame.DataFrame

In [18]:
l2=[[1,2,3,4],[34,5,6,78]]
df1=pd.DataFrame(l2)
df1

    0  1  2   3
0   1  2  3   4
1  34  5  6  78

In [19]:
df1.index

RangeIndex(start=0, stop=2, step=1)

In [20]:
df1.columns   # for finding only columnn

RangeIndex(start=0, stop=4, step=1)

In [21]:
l2=[[1,2,3,4],[34,5,6,78]]
df1=pd.DataFrame(l2,index=["a","b"],columns=["A","B","C","D"])
df1

    A  B  C   D
a   1  2  3   4
b  34  5  6  78

In [22]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

# Dealing with rows

In [29]:
# FeTCH TOP 5 ROWS
data={"country":["india","uk","austria","us","canada","pakistan"],"GDP":[123,123,678,2134,3456,232],"country_type":["developing","developed","developed","developed","developed","developing"]}  # from dictionary 
pd.DataFrame(data)

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [30]:
df.head

<bound method NDFrame.head of    0
0  1
1  2
2  3
3  4>

In [31]:
df.tail

<bound method NDFrame.tail of    0
0  1
1  2
2  3
3  4>

# iloc

In [38]:
data={"country":["india","uk","austria","us","canada","pakistan"],"GDP":[123,123,678,2134,3456,232],"country_type":["developing","developed","developed","developed","developed","developing"]}  # from dictionary 
df=pd.DataFrame(data)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [39]:
df.iloc[-1]

country           pakistan
GDP                    232
country_type    developing
Name: 5, dtype: object

In [40]:
df.iloc[2:5]

   country   GDP country_type
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

In [41]:
df.iloc[3]   #fetch row 3

country                us
GDP                  2134
country_type    developed
Name: 3, dtype: object

In [42]:
df.iloc[[1,4,5]]   # for finding the specific rows

    country   GDP country_type
1        uk   123    developed
4    canada  3456    developed
5  pakistan   232   developing

In [44]:
df.iloc[:,2]

0    developing
1     developed
2     developed
3     developed
4     developed
5    developing
Name: country_type, dtype: object

In [45]:
df.iloc[:,1:]

    GDP country_type
0   123   developing
1   123    developed
2   678    developed
3  2134    developed
4  3456    developed
5   232   developing

In [46]:
df.iloc[[2,4],[0,2]]

   country country_type
2  austria    developed
4   canada    developed

# loc

In [50]:
df.set_index(df["country"],inplace=True)
df

           country   GDP country_type
country
india        india   123   developing
uk              uk   123    developed
austria    austria   678    developed
us              us  2134    developed
canada      canada  3456    developed
pakistan  pakistan   232   developing

In [51]:
df.index

Index(['india', 'uk', 'austria', 'us', 'canada', 'pakistan'], dtype='object', name='country')

In [52]:
df.columns

Index(['country', 'GDP', 'country_type'], dtype='object')

In [53]:
df.drop(columns=["country"],inplace=True)
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [54]:
df.loc["uk"]

GDP                   123
country_type    developed
Name: uk, dtype: object

In [55]:
df.loc["uk":"pakistan"]

           GDP country_type
country
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [56]:
df.loc[["uk","canada"]]

          GDP country_type
country
uk        123    developed
canada   3456    developed

In [57]:
df.loc[:,["GDP"]]

           GDP
country
india      123
uk         123
austria    678
us        2134
canada    3456
pakistan   232

# reset index

In [58]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [59]:
df.reset_index(inplace=True)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

# addition of new rows

In [ ]:
#### using append()- adding of two data

In [2]:
import pandas as pd
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12]],columns = ['1','2'])

In [3]:
d2

    1   2
0  11  12

In [4]:
d

   x   y
0  7   8
1  9  10

In [5]:
d=d.append(d2)
d

C:\Users\hp\AppData\Local\Temp\ipykernel_5736\4152085534.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d=d.append(d2)

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
0  NaN   NaN  11.0  12.0

In [6]:
d1=d.append(d2,ignore_index=True)
d1

C:\Users\hp\AppData\Local\Temp\ipykernel_5736\2417568729.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1=d.append(d2,ignore_index=True)

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
2  NaN   NaN  11.0  12.0
3  NaN   NaN  11.0  12.0

In [7]:
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12],[2,3]],columns=["x","y"])  
d1 = d.append(d2)  
d1

C:\Users\hp\AppData\Local\Temp\ipykernel_5736\1608176411.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1 = d.append(d2)

    x   y
0   7   8
1   9  10
0  11  12
1   2   3

In [9]:
d1 = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }

df1=pd.DataFrame(d1)
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [10]:
df1.iloc[2]=["physics",78,89]
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2  physics     78       89
3  Georgia     95       76

In [12]:
df1.iloc[1:3]=[["heena",45,67],["himani",45,78]]

In [13]:
df1

      Name  Maths  Science
0   Martha     87       83
1    heena     45       67
2   himani     45       78
3  Georgia     95       76

In [14]:
df1["Name"].iloc[0]="lavi"
df1

C:\Users\hp\AppData\Local\Temp\ipykernel_5736\2808218614.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["Name"].iloc[0]="lavi"

      Name  Maths  Science
0     lavi     87       83
1    heena     45       67
2   himani     45       78
3  Georgia     95       76

In [15]:
df1.set_index("Name",inplace=True)
df1

         Maths  Science
Name
lavi        87       83
heena       45       67
himani      45       78
Georgia     95       76

In [16]:
df1.loc["jai"]=[23,45]
df1

         Maths  Science
Name
lavi        87       83
heena       45       67
himani      45       78
Georgia     95       76
jai         23       45

In [17]:
df1.reset_index(inplace=True)
df1

      Name  Maths  Science
0     lavi     87       83
1    heena     45       67
2   himani     45       78
3  Georgia     95       76
4      jai     23       45

In [ ]:
#iloc can do only update but loc can expand and also update

In [ ]:
# row deletion

In [18]:
df1.drop(1,inplace=True)
df1

      Name  Maths  Science
0     lavi     87       83
2   himani     45       78
3  Georgia     95       76
4      jai     23       45

In [19]:
df2 = pd.DataFrame([[4, 5], [6, 7]], columns = ['x','y'])  
df2

   x  y
0  4  5
1  6  7

In [22]:
df3=df2.drop(0)
df3

   x  y
1  6  7

In [23]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [24]:
df.drop(index=df.index[0:6:2])    #delete every alterntae rows

    state  population state_region
1  gujrat          80         west
3     goa          10        south
5  sikkim          30         east

# columns

In [25]:
df["state"]

0     delhi
1    gujrat
2        up
3       goa
4        mp
5    sikkim
Name: state, dtype: object

In [26]:
df[["state","state_region"]]   #column selection

    state state_region
0   delhi        north
1  gujrat         west
2      up        north
3     goa        south
4      mp        south
5  sikkim         east

In [ ]:
# column drop

In [29]:
# column renaming
df.rename(columns={"state":"country_state"},inplace=True)

In [30]:
df

  country_state  population state_region
0         delhi          90        north
1        gujrat          80         west
2            up          70        north
3           goa          10        south
4            mp          34        south
5        sikkim          30         east

In [32]:
# columns reordering
df=df[["population","country_state","state_region"]]
df

   population country_state state_region
0          90         delhi        north
1          80        gujrat         west
2          70            up        north
3          10           goa        south
4          34            mp        south
5          30        sikkim         east

In [34]:
## additon of new columns
l=[]
for i in df["population"]:
    l.append(i*i)
l

[8100, 6400, 4900, 100, 1156, 900]

In [35]:
s=pd.Series(l)
s

0    8100
1    6400
2    4900
3     100
4    1156
5     900
dtype: int64

In [36]:
type(s)

pandas.core.series.Series

In [41]:
df["p_square"]=s
df

C:\Users\hp\AppData\Local\Temp\ipykernel_5736\2688551004.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["p_square"]=s

   population country_state state_region  p_square  population_square
0          90         delhi        north      8100               8100
1          80        gujrat         west      6400               6400
2          70            up        north      4900               4900
3          10           goa        south       100                100
4          34            mp        south      1156               1156
5          30        sikkim         east       900                900

In [ ]:
### extracting coulmns from particular type

In [42]:
df.select_dtypes(include="object")

  country_state state_region
0         delhi        north
1        gujrat         west
2            up        north
3           goa        south
4            mp        south
5        sikkim         east

In [44]:
df.select_dtypes(include="object").columns

Index(['country_state', 'state_region'], dtype='object')

In [47]:
df["population"]=df["population"].astype("float")

C:\Users\hp\AppData\Local\Temp\ipykernel_5736\2163059590.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["population"]=df["population"].astype("float")

In [ ]:
numeric=["float","int"]
df.Series

In [ ]:
# pandas series can be form as

In [ ]:
# creating series from array

In [50]:
import numpy as np
import pandas as pd

In [ ]:
data=

In [51]:
l=[["a","b","c"],["aa","bb","cc"]]
ser1=pd.Series()
print(ser1)
print(type(ser1))

Series([], dtype: float64)
<class 'pandas.core.series.Series'>

C:\Users\hp\AppData\Local\Temp\ipykernel_5736\1998192002.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser1=pd.Series()

In [52]:
d={"a":10,"b":20,"c":30}
s=pd.Series(data=d)
s

a    10
b    20
c    30
dtype: int64

In [53]:
s=pd.Series(data=d,index=["x","y","z"])
s

x   NaN
y   NaN
z   NaN
dtype: float64

In [57]:
s.reset_index()

  index   0
0     x NaN
1     y NaN
2     z NaN

In [60]:
s.drop(columns=[0])

x   NaN
y   NaN
z   NaN
dtype: float64

In [ ]:
s.drop

In [62]:
# create s series using scalar:
x=pd.Series(4,index=[0,1,2,3])
print(x)

0    4
1    4
2    4
3    4
dtype: int64

In [64]:
x.shape

(4,)

In [88]:
date=pd.date_range("1/1/2000",periods=12)  ## date range is a pandas function to generate dates 
date

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10', '2000-01-11', '2000-01-12'],
              dtype='datetime64[ns]', freq='D')

In [89]:
x1=pd.DataFrame(date,columns=["date"])
x1

         date
0  2000-01-01
1  2000-01-02
2  2000-01-03
3  2000-01-04
4  2000-01-05
5  2000-01-06
6  2000-01-07
7  2000-01-08
8  2000-01-09
9  2000-01-10
10 2000-01-11
11 2000-01-12

In [90]:
# add a new columns to this parcticular fram
a=np.arange(12)
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [91]:
x1["newcol"]=pd.Series(a)
x1

         date  newcol
0  2000-01-01       0
1  2000-01-02       1
2  2000-01-03       2
3  2000-01-04       3
4  2000-01-05       4
5  2000-01-06       5
6  2000-01-07       6
7  2000-01-08       7
8  2000-01-09       8
9  2000-01-10       9
10 2000-01-11      10
11 2000-01-12      11

In [93]:
# date as a index
x1.set_index(x1["date"])

            index       date  newcol
date
2000-01-01      0 2000-01-01       0
2000-01-02      1 2000-01-02       1
2000-01-03      2 2000-01-03       2
2000-01-04      3 2000-01-04       3
2000-01-05      4 2000-01-05       4
2000-01-06      5 2000-01-06       5
2000-01-07      6 2000-01-07       6
2000-01-08      7 2000-01-08       7
2000-01-09      8 2000-01-09       8
2000-01-10      9 2000-01-10       9
2000-01-11     10 2000-01-11      10
2000-01-12     11 2000-01-12      11

In [ ]:
x1

In [94]:
 x1.reset_index(inplace=True)

In [95]:
x1

    level_0  index       date  newcol
0         0      0 2000-01-01       0
1         1      1 2000-01-02       1
2         2      2 2000-01-03       2
3         3      3 2000-01-04       3
4         4      4 2000-01-05       4
5         5      5 2000-01-06       5
6         6      6 2000-01-07       6
7         7      7 2000-01-08       7
8         8      8 2000-01-09       8
9         9      9 2000-01-10       9
10       10     10 2000-01-11      10
11       11     11 2000-01-12      11